//СОБЫТИЯ НА МОБИЛЬНЫХ УСТРОЙСТВАХ

//1) touchstart - событие происходит при соприкосновении пальца с экраном

//2) touchmove - палец при касании начинает двигаться

//3) touchend - как только палец оторвался от элемента событие выполнится

//4) touchenter - срабатывает когда ведем пальцем по экрану и при этом наскакиваем на элемент, на который навешено событие

//5) touchleave - палец продолжил скользить и ушел за пределы этого элемента

//6) touchcancel - возникает, когда точка соприкосновения больше не регистрируется на поверхности(напр, палец вышел за пределы браузера)